const menuData = [
  {
    category: "학공통",
    subSections: [
      {
        title: "공통",
        items: ["개인정보수집및이용동의"],
      },
    ],
  },
  {
    category: "학적",
    subSections: [
      {
        title: "학적관리",
        items: [
          "인적사항변경",
          "학력조회",
          "자치기구활동관리",
          "동아리활동관리",
        ],
      },
      {
        title: "조기졸업신청",
        items: ["조기졸업신청"],
      },
      {
        title: "학적변동관리",
        items: ["휴학신청/취소", "복학신청/취소"],
      },
      {
        title: "전공진입관리",
        items: [
          "단과대학 전공진입 신청",
          "단과대학 전공진입 실시간통계",
          "단과대학 전공진입 사정현황 통계",
          "KU 전공진입 신청",
        ],
      },
      {
        title: "전공배정관리",
        items: ["전공배정 신청", "전공배정 실시간통계", "전공배정현황통계"],
      },
      {
        title: "전과관리",
        items: ["전과신청", "전과신청현황 실시간 통계", "전과사정현황 통계"],
      },
      {
        title: "제2전공신청/포기",
        items: [
          "다전공 신청",
          "부전공 신청",
          "연계전공 신청",
          "연합전공 신청",
          "융합전공 신청",
          "심화전공 신청",
          "소단위전공 신청",
          "다부전공 등 이수확인서 출력",
          "다전공선발현황 통계",
        ],
      },
      {
        title: "소속관리",
        items: ["소속변경신청"],
      },
      {
        title: "전공프로그램관리",
        items: ["4학년 전공프로그램 배정신청"],
      },
    ],
  },
  {
    category: "수업",
    subSections: [
      {
        title: "교육과정",
        items: ["동일대체과목관리", "소단위전공교육과정"],
      },
      {
        title: "강의계획서",
        items: ["강의계획서조회", "Course Syllabus VIEW"],
      },
      {
        title: "강의시간표",
        items: ["종합강의시간표조회"],
      },
      {
        title: "수강신청",
        items: [
          "수강시뮬레이션",
          "개인강의시간표조회",
          "수강신청내역조회",
          "수강신청내역 로그조회",
          "계절학기 환불신청",
          "계절학기 환불조회",
        ],
      },
      {
        title: "강의평가",
        items: [
          "강의평가참여(Participate In Class Evaluation)",
          "강의평가결과조회(학생용)",
        ],
      },
    ],
  },
  {
    category: "성적",
    subSections: [
      {
        title: "금학기성적",
        items: ["정규학기성적조회", "계절학기성적조회"],
      },
      {
        title: "전체성적",
        items: ["전체성적조회"],
      },
      {
        title: "성적인정",
        items: ["외국어교과목수강면제신청"],
      },
      {
        title: "성적삭제",
        items: ["취득학점포기신청"],
      },
    ],
  },
  {
    category: "장학",
    subSections: [
      {
        title: "장학신청관리",
        items: ["장학금신청(학부생)", "장학금수혜계좌등록"],
      },
      {
        title: "장학관리",
        items: ["(고지감면)장학상세조회"],
      },
      {
        title: "장학출력",
        items: ["장학수혜증명서발급"],
      },
    ],
  },
  {
    category: "등록",
    subSections: [
      {
        title: "등록관련 출력",
        items: ["고지서출력", "납부확인서", "교육비 납입증명서"],
      },
      {
        title: "분할납부신청",
        items: ["분할납부신청"],
      },
    ],
  },
  {
    category: "졸업",
    subSections: [
      {
        title: "졸업자관리",
        items: [
          "졸업 시뮬레이션",
          "취득학점확인원(학생용)",
          "졸업가능여부조회",
        ],
      },
      {
        title: "미졸자관리",
        items: ["졸업유예신청/취소및결과조회"],
      },
      {
        title: "전공프로그램관리",
        items: ["전공프로그램 시뮬레이션"],
      },
      {
        title: "소단위전공관리",
        items: ["소단위전공 시뮬레이션"],
      },
    ],
  },
  {
    category: "학생",
    subSections: [
      {
        title: "사회봉사",
        items: ["보고서/서류제출", "인증제 대상자 봉사시간 등록"],
      },
      {
        title: "체육시설사용신청",
        items: ["체육시설사용신청/조회"],
      },
      {
        title: "학술공간사용신청",
        items: ["학술공간사용신청/조회"],
      },
    ],
  },
  {
    category: "교직",
    subSections: [
      {
        title: "교직이수예정자",
        items: ["교직이수신청", "합격자조회"],
      },
      {
        title: "교직다전공",
        items: ["교직다전공이수신청"],
      },
      {
        title: "교직사정부",
        items: ["교직시뮬레이션(학생)"],
      },
      {
        title: "교육봉사활동",
        items: [
          "교육봉사활동신청",
          "교육봉사활동내용입력",
          "교육봉사활동인정시간신청",
        ],
      },
      {
        title: "교직적인성검사",
        items: ["적인성검사신청 및 결과조회", "적인성검사평가"],
      },
      {
        title: "응급심폐소생술",
        items: ["응급심폐소생술신청및결과조회"],
      },
      {
        title: "성인지교육",
        items: ["성인지교육신청및결과조회"],
      },
      {
        title: "무시험검정",
        items: ["무시험검정원서신청"],
      },
    ],
  },
  {
    category: "국제협력",
    subSections: [
      {
        title: "교환학생관리(OUTBOUND)",
        items: ["교류프로그램 신청"],
      },
    ],
  },
  {
    category: "공학인증",
    subSections: [
      {
        title: "수업관리",
        items: ["수강강좌설문조사", "수강강좌상담신청", "강의계획서조회"],
      },
    ],
  },
  {
    category: "예비군",
    subSections: [
      {
        title: "예비군 자원관리",
        items: ["예비군대원신고"],
      },
      {
        title: "예비군 교육훈련관리",
        items: ["예비군훈련대상자조회", "예비군훈련참여출력"],
      },
    ],
  },
];

export default menuData;
