const menuData = [
  {
    id: "1100000",
    category: "학공통",
    subSections: [
      {
        id: "1100100",
        title: "공통",
        items: [{ id: "1100101", name: "개인정보수집및이용동의" }],
      },
    ],
  },
  {
    id: "1120000",
    category: "학적",
    subSections: [
      {
        id: "1122200",
        title: "학적관리",
        items: [
          { id: "1122203", name: "인적사항변경" },
          { id: "1122208", name: "학력조회" },
          { id: "1122221", name: "자치기구활동관리" },
          { id: "1122222", name: "동아리활동관리" },
        ],
      },
      {
        id: "1122500",
        title: "조기졸업신청",
        items: [{ id: "1122502", name: "조기졸업신청" }],
      },
      {
        id: "1122100",
        title: "학적변동관리",
        items: [
          { id: "1122103", name: "휴학신청/취소" },
          { id: "1122107", name: "복학신청/취소" },
        ],
      },
      {
        id: "1124000",
        title: "전공진입관리",
        items: [
          { id: "1124001", name: "단과대학 전공진입 신청" },
          { id: "1124002", name: "단과대학 전공진입 실시간통계" },
          { id: "1124008", name: "단과대학 전공진입 사정현황 통계" },
          { id: "1124010", name: "KU 전공진입 신청" },
        ],
      },
      {
        id: "1124100",
        title: "전공배정관리",
        items: [
          { id: "1124101", name: "전공배정 신청" },
          { id: "1124102", name: "전공배정 실시간통계" },
          { id: "1124108", name: "전공배정현황통계" },
        ],
      },
      {
        id: "1123100",
        title: "전과관리",
        items: [
          { id: "1123101", name: "전과신청" },
          { id: "1123102", name: "전과신청현황 실시간 통계" },
          { id: "1123108", name: "전과사정현황 통계" },
        ],
      },
      {
        id: "1124200",
        title: "제2전공신청/포기",
        items: [
          { id: "1124201", name: "다전공 신청" },
          { id: "1124202", name: "부전공 신청" },
          { id: "1124203", name: "연계전공 신청" },
          { id: "1124204", name: "연합전공 신청" },
          { id: "1124205", name: "융합전공 신청" },
          { id: "1124206", name: "심화전공 신청" },
          { id: "1124211", name: "소단위전공 신청" },
          { id: "1124209", name: "다부전공 등 이수확인서 출력" },
          { id: "1124212", name: "다전공선발현황 통계" },
        ],
      },
      {
        id: "1122600",
        title: "소속관리",
        items: [{ id: "1122604", name: "소속변경신청" }],
      },
      {
        id: "1123000",
        title: "전공프로그램관리",
        items: [{ id: "1123001", name: "4학년 전공프로그램 배정신청" }],
      },
    ],
  },
  {
    id: "1130000",
    category: "수업",
    subSections: [
      {
        id: "1130100",
        title: "교육과정",
        items: [
          { id: "1130110", name: "동일대체과목관리" },
          { id: "1130116", name: "소단위전공교육과정" },
        ],
      },
      {
        id: "1130300",
        title: "강의계획서",
        items: [
          { id: "1130310", name: "강의계획서조회" },
          { id: "1130307", name: "Course Syllabus VIEW" },
        ],
      },
      {
        id: "1130400",
        title: "강의시간표",
        items: [{ id: "1130420", name: "종합강의시간표조회" }],
      },
      {
        id: "1130500",
        title: "수강신청",
        items: [
          { id: "1130529", name: "수강시뮬레이션" },
          { id: "1130509", name: "개인강의시간표조회" },
          { id: "1130507", name: "수강신청내역조회" },
          { id: "1130527", name: "수강신청내역 로그조회" },
          { id: "1130519", name: "계절학기 환불신청" },
          { id: "1130521", name: "계절학기 환불조회" },
        ],
      },
      {
        id: "1130800",
        title: "강의평가",
        items: [
          {
            id: "1130804",
            name: "강의평가참여(Participate In Class Evaluation)",
          },
          { id: "1130810", name: "강의평가결과조회(학생용)" },
        ],
      },
    ],
  },
  {
    id: "1140000",
    category: "성적",
    subSections: [
      {
        id: "1140300",
        title: "성적조회",
        items: [
          { id: "1140302", name: "성적조회" },
        ],
      },
      {
        id: "1140500",
        title: "성적인정",
        items: [{ id: "1140505", name: "외국어교과목수강면제신청" }],
      },
      {
        id: "1140600",
        title: "성적삭제",
        items: [{ id: "1140606", name: "취득학점포기신청" }],
      },
    ],
  },
  {
    id: "1150000",
    category: "장학",
    subSections: [
      {
        id: "1150500",
        title: "장학신청관리",
        items: [
          { id: "1150502", name: "장학금신청(학부생)" },
          { id: "1150505", name: "장학금수혜계좌등록" },
        ],
      },
      {
        id: "1150200",
        title: "장학관리",
        items: [{ id: "1150228", name: "(고지감면)장학상세조회" }],
      },
      {
        id: "1150300",
        title: "장학출력",
        items: [{ id: "1150304", name: "장학수혜증명서발급" }],
      },
    ],
  },
  {
    id: "1160000",
    category: "등록",
    subSections: [
      {
        id: "1160500",
        title: "등록관련 출력",
        items: [
          { id: "1160505", name: "고지서출력" },
          { id: "1160506", name: "납부확인서" },
          { id: "1160507", name: "교육비 납입증명서" },
        ],
      },
      {
        id: "1160700",
        title: "분할납부신청",
        items: [{ id: "1160701", name: "분할납부신청" }],
      },
    ],
  },
  {
    id: "1170000",
    category: "졸업",
    subSections: [
      {
        id: "1170200",
        title: "졸업자관리",
        items: [
          { id: "1170201", name: "졸업 시뮬레이션" },
        ],
      },
      {
        id: "1170500",
        title: "미졸자관리",
        items: [{ id: "1170503", name: "졸업유예신청/취소및결과조회" }],
      },
      {
        id: "1170700",
        title: "전공프로그램관리",
        items: [{ id: "1170702", name: "전공프로그램 시뮬레이션" }],
      },
      {
        id: "1170800",
        title: "소단위전공관리",
        items: [{ id: "1170802", name: "소단위전공 시뮬레이션" }],
      },
    ],
  },
  {
    id: "1180000",
    category: "학생",
    subSections: [
      {
        id: "1180200",
        title: "사회봉사",
        items: [
          { id: "1180210", name: "보고서/서류제출" },
          { id: "1180211", name: "인증제 대상자 봉사시간 등록" },
        ],
      },
      {
        id: "1180400",
        title: "체육시설사용신청",
        items: [{ id: "1180402", name: "체육시설사용신청/조회" }],
      },
      {
        id: "1180700",
        title: "학술공간사용신청",
        items: [{ id: "1180702", name: "학술공간사용신청/조회" }],
      },
    ],
  },
  {
    id: "1190000",
    category: "교직",
    subSections: [
      {
        id: "1190200",
        title: "교직이수예정자",
        items: [
          { id: "1190201", name: "교직이수신청" },
          { id: "1190212", name: "합격자조회" },
        ],
      },
      {
        id: "1190600",
        title: "교직다전공",
        items: [{ id: "1190601", name: "교직다전공이수신청" }],
      },
      {
        id: "1191300",
        title: "교직사정부",
        items: [{ id: "1191302", name: "교직시뮬레이션(학생)" }],
      },
      {
        id: "1190800",
        title: "교육봉사활동",
        items: [
          { id: "1190802", name: "교육봉사활동신청" },
          { id: "1190804", name: "교육봉사활동내용입력" },
          { id: "1190806", name: "교육봉사활동인정시간신청" },
        ],
      },
      {
        id: "1191000",
        title: "교직적인성검사",
        items: [
          { id: "1191008", name: "적인성검사신청 및 결과조회" },
          { id: "1191003", name: "적인성검사평가" },
        ],
      },
      {
        id: "1191100",
        title: "응급심폐소생술",
        items: [{ id: "1191101", name: "응급심폐소생술신청및결과조회" }],
      },
      {
        id: "1191400",
        title: "성인지교육",
        items: [{ id: "1191401", name: "성인지교육신청및결과조회" }],
      },
      {
        id: "1191500",
        title: "무시험검정",
        items: [{ id: "1191501", name: "무시험검정원서신청" }],
      },
    ],
  },
  {
    id: "1220000",
    category: "국제협력",
    subSections: [
      {
        id: "1220200",
        title: "교환학생관리(OUTBOUND)",
        items: [{ id: "1220203", name: "교류프로그램 신청" }],
      },
    ],
  },
  {
    id: "1230000",
    category: "공학인증",
    subSections: [
      {
        id: "1230300",
        title: "수업관리",
        items: [
          { id: "1230303", name: "수강강좌설문조사" },
          { id: "1230304", name: "수강강좌상담신청" },
          { id: "1230307", name: "강의계획서조회" },
        ],
      },
    ],
  },
  {
    id: "1420000",
    category: "예비군",
    subSections: [
      {
        id: "1420100",
        title: "예비군 자원관리",
        items: [{ id: "1420113", name: "예비군대원신고" }],
      },
      {
        id: "1420200",
        title: "예비군 교육훈련관리",
        items: [
          { id: "1420208", name: "예비군훈련대상자조회" },
          { id: "1420210", name: "예비군훈련참여출력" },
        ],
      },
    ],
  },
];

export default menuData;